# -*- coding: utf:8-*-
# !/usr/bin/env python
# @Date    : 2019-10-12 16:42
# @Author  : olaheihei (728037549@qq.com)

class conPPTX():
    # 初始化，创建ppt对象
    def __init__(self):
        self.db={
            "host":"192.168.2.92",
            "user":"root",
            "passwd":"HmElIsBkPKQNmfN2",
            "database":"weekly"
        }

        self.base_order = [
            '项目协调部',
            '组织部',
            'C端产品部',
            'QA',
            '项目一部',
            '项目二部',
            '项目三部',
            '项目四部',
            'App研发部',
            '前端部',
            '数据挖掘部',
            'OPS-IT运维部',
            '终端支持部',
        ]

        self.font_name = '微软雅黑'
        self.font_size = {'表格': 16, '图片': 20, '团建': 16, '问题': 12}

        self.base_layouts = {
            '工作内容': 1,
            '团队建设': 2,
            '图片': 3,
            '问题': 4,
            '其他表格': 5,
            '其他文字': 6,
            '其他图片': 7
        }
        self.team_layouts = {
            '项目协调部': [1, 2, 3, 4, 5, 6, 7],
            '组织部':[1,2,3,4,5,6,7],
            '产品部':[1,2,3,4,5,6,7],
            'QA': [1, 5, 2, 3, 4, 6, 7],
            '项目一部':[1,2,3,4,5,6,7],
            '项目二部':[1,2,3,4,5,6,7],
            '项目三部':[1,2,3,4,5,6,7],
            '项目四部':[1,2,3,4,5,6,7],
            'App研发部':[1,2,3,4,5,6,7],
            '前端部':[1,2,3,4,5,6,7],
            '数据挖掘部': [1, 2, 3, 4, 5, 6, 7],
            'OPS-IT运维部':[1,2,3,4,5,6,7],
            '终端支持部': [1, 2, 3, 4, 5, 6, 7],
        }

        self.team_leader = {
            '组织部': '邢猛',
            '项目协调部': '张敏',
            '项目一部': '刘建亮',
            '项目二部': '于昆阳',
            '项目三部': '麻永峰',
            '项目四部': '杨毓平',
            '终端支持部': '张春阳',
            '质量保障部': '周健',
            'C端产品部': '宋子斌',
            'App研发部': '郭汶强',
            '前端部': '余尚辉',
            '数据挖掘部': '王海龙',
            '运维部': '冯睿'
        }
