# -*- coding: utf:8-*-
# !/usr/bin/env python
# @Date    : 2019-10-12 16:42
# @Author  : olaheihei (728037549@qq.com)

class conPPTX():
    # 初始化，创建ppt对象
    def __init__(self):
        self.db={
            "host":"192.168.2.92",
            "user":"root",
            "passwd":"HmElIsBkPKQNmfN2",
            "database":"weekly"
        }

        self.base_order = [
            '组织部',
            'C端产品组',
            '项目协调组',
            '项目一部',
            '项目二部',
            '项目三部',
            '项目四部',
            '终端支持部',
            'App研发部',
            '前端部',
            '质量保障部',
            '运维部',
            '数据挖掘部'
        ]

        self.font_name = '微软雅黑'
        self.font_size = {'表格': 16, '图片': 20, '团建': 16, '问题': 12}
        # self.base_layouts = {
        # 	'首页' : 0,
        # 	'目录' : 1,
        # 	'表格' : 2,
        # 	'图片' : 3,
        # 	'问题' : 4,
        # 	'团建' : 5,
        # 	'自定义': 6
        # }
        self.base_layouts = {
            '工作内容': 1,
            '团队建设': 2,
            '图片': 3,
            '问题': 4,
            '其他文字': 5,
            '其他表格': 6,
            '其他图片': 7
        }
        self.team_layouts = {
            '组织部':[],
            'C端产品组':[],
            '项目协调组':[1,3,4,2,6,5,7],
            '项目一部':[],
            '项目二部':[],
            '项目三部':[],
            '项目四部':[],
            '终端支持部':[],
            'App研发部':[],
            '前端部':[],
            '质量保障部':[2,1,3,4,6,5,7],
            '运维部':[],
            '数据挖掘部':[]
        }

        self.team_leader = {
            '组织部': '邢猛',
            '项目协调部': '张敏',
            '项目一部': '刘建亮',
            '项目二部': '于昆阳',
            '项目三部': '麻永峰',
            '项目四部': '杨毓平',
            '终端支持部': '张春阳',
            '质量保障部': '周健',
            'C端产品部': '宋子斌',
            'App研发部': '郭汶强',
            '前端部': '余尚辉',
            '数据挖掘部': '王海龙',
            '运维部': '冯睿'
        }
